In [6]:
import os
import pandas as pd
#아니 이 말을 이렇게 어렵게 정리해 놨다고? 내가 정리해준다.
#os.path.join이 뭐냐면 경로 합치는 명령어임!
# 예를 들어서 os.path.join('a','b')는 a/b라는 "새경로를 생성"해줌!(리스트로 전달 가능)

#s=os.path.join('https://archive.ics.edu','ml','machine-learning-databases','iris','iris.data')
#print("합친 경로:",s)

합친 경로: https://archive.ics.edu\ml\machine-learning-databases\iris\iris.data

In [7]:
#자 이건 또 무슨 말이냐면 위와 같이 똑같이 경로를 합치는데 이때 인자가 
#pwd같은 os.getcwd를 사용해서 한 인자를 주는거
print(os.path.join(os.getcwd(),'file.py'))

C:\Users\J-365\file.py

In [9]:
#절대경로출력
print(os.path.abspath("web-crawler-py/parsed_data"))

C:\Users\web-crawler-py\parsed_data

In [10]:
"https://archive.ics.edu','ml','machine-learning-databases".split(os.path.sep)

["https://archive.ics.edu','ml','machine-learning-databases"]

In [21]:
#판다스에는 시리즈와 데이터프레임(테이블생성느낌) 패널이 있다.
#시리즈는 리스트(1차원의 데이터)와 비슷한데 인덱스에 이름 부여 가능->Series()
#데이터프레임은 2차원 자료궂로 행열 존재

In [18]:
#딕셔너리 형식으로 2차원 배열 선언(테이블생성 느낌)
data={'name':['길동','지선','prcnsi','나야나'],
      'age':[21,21,21,21],
      'num':[6793,3434,4332,3424],
      'house':['myeong_ji','myeong_ji',"sindosi",'busan']
     }
data1=pd.DataFrame(data,index=list('1234'))
print(data1)

     name  age   num      house
1      길동   21  6793  myeong_ji
2      지선   21  3434  myeong_ji
3  prcnsi   21  4332    sindosi
4     나야나   21  3424      busan

In [23]:
print(data1.info())

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 1 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    4 non-null      object
 1   age     4 non-null      int64
 2   num     4 non-null      int64
 3   house   4 non-null      object
dtypes: int64(2), object(2)
memory usage: 160.0+ bytes
None

In [19]:
print(data1.T)
#치환

               1          2        3      4
name          길동         지선   prcnsi    나야나
age           21         21       21     21
num         6793       3434     4332   3424
house  myeong_ji  myeong_ji  sindosi  busan

In [20]:
data1.index

Index(['1', '2', '3', '4'], dtype='object')

In [21]:
data1.columns

Index(['name', 'age', 'num', 'house'], dtype='object')

In [22]:
print(data1.T)

               1          2        3      4
name          길동         지선   prcnsi    나야나
age           21         21       21     21
num         6793       3434     4332   3424
house  myeong_ji  myeong_ji  sindosi  busan

In [28]:
data1.columns

Index(['name', 'age', 'num', 'house'], dtype='object')

In [23]:
print(data1)

     name  age   num      house
1      길동   21  6793  myeong_ji
2      지선   21  3434  myeong_ji
3  prcnsi   21  4332    sindosi
4     나야나   21  3424      busan

In [24]:
data1.values

array([['길동', 21, 6793, 'myeong_ji'],
       ['지선', 21, 3434, 'myeong_ji'],
       ['prcnsi', 21, 4332, 'sindosi'],
       ['나야나', 21, 3424, 'busan']], dtype=object)

In [31]:
data1.describe()

        age          num
count   4.0     4.000000
mean   21.0  4495.750000
std     0.0  1589.563121
min    21.0  3424.000000
25%    21.0  3431.500000
50%    21.0  3883.000000
75%    21.0  4947.250000
max    21.0  6793.000000

In [51]:
read_data=pd.read_csv('C:/Users/J-365/Downloads/iris.data',header=None,encoding='utf=8')
print(read_data)

       0    1    2    3               4
0    5.1  3.5  1.4  0.2     Iris-setosa
1    4.9  3.0  1.4  0.2     Iris-setosa
2    4.7  3.2  1.3  0.2     Iris-setosa
3    4.6  3.1  1.5  0.2     Iris-setosa
4    5.0  3.6  1.4  0.2     Iris-setosa
..   ...  ...  ...  ...             ...
145  6.7  3.0  5.2  2.3  Iris-virginica
146  6.3  2.5  5.0  1.9  Iris-virginica
147  6.5  3.0  5.2  2.0  Iris-virginica
148  6.2  3.4  5.4  2.3  Iris-virginica
149  5.9  3.0  5.1  1.8  Iris-virginica

[150 rows x 5 columns]

In [14]:
import pandas as pd
readed_data=pd.read_csv('C:/Users/J-365/Downloads/train.csv',header=None,encoding='utf=8')
data2=pd.DataFrame(readed_data,index=list('1234'))
readed_data.head(5)

,0,1,2,3,4,5,6,7,8,9,10,11
0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.25,NaN,S
2,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C
3,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.925,NaN,S
4,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1,C123,S

In [15]:
readed_data.shape

(892, 12)

In [29]:
readed_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 892 entries, 0 to 891
Data columns (total 12 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       892 non-null    object
 1   1       892 non-null    object
 2   2       892 non-null    object
 3   3       892 non-null    object
 4   4       892 non-null    object
 5   5       715 non-null    object
 6   6       892 non-null    object
 7   7       892 non-null    object
 8   8       892 non-null    object
 9   9       892 non-null    object
 10  10      205 non-null    object
 11  11      890 non-null    object
dtypes: object(12)
memory usage: 83.8+ KB

In [30]:
#딕셔너리로 DataFrame 만드려면 선언할 때 key=행 시작 값,value=세로로 나열된다 생각하고 선언!
dic={'김':[1,2,3],'이':[33,43,34],'박':[345,46,567]}
df_dic=pd.DataFrame(dic)
print(df_dic)

   김   이    박
0  1  33  345
1  2  43   46
2  3  34  567

In [27]:
print(df_dic.shape)

(3, 3)

In [28]:
print(type(df_dic))

<class 'pandas.core.frame.DataFrame'>

In [32]:
#칼럼 추가는 읽어들인 파일명[칼럼명]='값'으로 할당 가능!
readed_data['ex']=0
readed_data.head(6)
#결론 ndarray나 Series나 칼럼 추가시 할당한 값은 모두 같은 값으로 초기화 됨

,0,1,2,3,4,5,6,7,8,9,10,11,ex
0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,0
1,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.25,NaN,S,0
2,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C,0
3,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.925,NaN,S,0
4,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1,C123,S,0
5,5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.05,NaN,S,0

In [40]:
#상수배 개념으로 값 할당도 가능
readed_data['new_multiply']=readed_data[9]*10
readed_data.head(5)

,0,1,2,3,4,5,6,7,8,9,10,11,ex,new_multiply
0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,0,FareFareFareFareFareFareFareFareFareFare
1,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.25,NaN,S,0,7.257.257.257.257.257.257.257.257.257.25
2,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C,0,71.283371.283371.283371.283371.283371.283371.2...
3,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.925,NaN,S,0,7.9257.9257.9257.9257.9257.9257.9257.9257.9257...
4,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1,C123,S,0,53.153.153.153.153.153.153.153.153.153.1